<h1>TASK-1</h1>

Create the following two Series: nameid = pd.Series(range(101, 111))

    name = pd.Series(['person' + str(i) for i in range(1, 11)])

    Create the dataframe master with series nameid and name. Let the column names be nameid and name respectively.

    Create the dataframe transaction using the command: transaction = pd.DataFrame({'nameid':[108, 108, 108,103], 'product':['iPhone', 'Nokia', 'Micromax', 'Vivo']})

    Merge master with transaction on nameid, and save the merged dataframe as mdf. Perform inner join. Note: Use the merge method.

    Display mdf.

In [1]:
import pandas as pd

In [2]:
nameid = pd.Series(range(101,111))

In [3]:
nameid

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
dtype: int64

In [4]:
name = pd.Series(['person' + str(i) for i in range(1, 11)])

In [5]:
name

0     person1
1     person2
2     person3
3     person4
4     person5
5     person6
6     person7
7     person8
8     person9
9    person10
dtype: object

In [6]:
frame = {"nameid":nameid,"name":name}
master = pd.DataFrame(frame)
master

   nameid      name
0     101   person1
1     102   person2
2     103   person3
3     104   person4
4     105   person5
5     106   person6
6     107   person7
7     108   person8
8     109   person9
9     110  person10

In [7]:
transaction = pd.DataFrame({'nameid':[108, 108, 108,103], 'product':['iPhone', 'Nokia', 'Micromax', 'Vivo']})

In [8]:
transaction

   nameid   product
0     108    iPhone
1     108     Nokia
2     108  Micromax
3     103      Vivo

In [9]:
mdf = pd.merge(master,transaction,on='nameid')
print(mdf)

   nameid     name   product
0     103  person3      Vivo
1     108  person8    iPhone
2     108  person8     Nokia
3     108  person8  Micromax